Repository: boychukmk/Django_Car_Leasing
Catalog: locale/*/LC_MESSAGES/django.po
Languages: uk

source: Petrol
uk: Бензин

source: Diesel
uk: Дизель

source: Electric
uk: Електричний

source: Hybrid
uk: Гібрид

source: Manual
uk: Механічна

source: Automatic
uk: Автоматична

source: Semi-Automatic
uk: Напівавтоматична

source: Front-Wheel Drive
uk: Передній привід

source: Rear-Wheel Drive
uk: Задній привід

source: All-Wheel Drive
uk: Повний привід

source: Black
uk: Чорний

source: White
uk: Білий

source: Red
uk: Червоний

source: Blue
uk: Синій

source: Grey
uk: Сірий

source: Name
uk: Назва

source: Price
uk: Ціна

source: Year
uk: Рік

source: Engine Capacity
uk: Обʼєм двигуна

source: Engine capacity in liters
uk: Обʼєм двигуна в літрах

source: Fuel Type
uk: Тип палива

source: Transmission
uk: Трансмісія

source: Mileage
uk: Пробіг

source: Mileage in kilometers
uk: Пробіг у кілометрах

source: Drive Type
uk: Тип приводу

source: Color
uk: Колір

source: Code
uk: Код

source: Photo
uk: Фото

source: Slug
uk: Слаг

source: Discount
uk: Знижка

source: Discount in percentage
uk: Знижка у відсотках

source: Car
uk: Автомобіль

source: Cars
uk: Автомобілі

source: Buy
uk: Купити

source: Discounted price
uk: Ціна зі знижкою

source: Lease this car
uk: Взяти в лізинг

source: BUY
uk: КУПИТИ

source: Filters
uk: Фільтри

source: Discounted
uk: Знижка

source: Default
uk: За замовчуванням

source: Price: Low to High
uk: Від дешевих до дорогих

source: Price: High to Low
uk: Від дорогих до дешевих

source: Sort
uk: Сортувати

source: Engine
uk: Двигун

source: Previous
uk: Попередня

source: Next
uk: Наступна

source: English
uk: Англійська

source: Ukrainian
uk: Українська

source: Start date must be from tomorrow onwards.
uk: Дата початку має бути від завтра і далі.

source: End date cannot be empty.
uk: Дата закінчення не може бути порожньою.

source: Start date cannot be empty.
uk: Дата початку не може бути порожньою.

source: End date must be at least 30 days ahead of start date.
uk: Дата закінчення повинна бути щонайменше на 30 днів пізніше дати початку.

source: Please select a service package.
uk: Будь ласка, виберіть пакет послуг.

source: Description
uk: Опис

source: Services
uk: Послуги

source: User
uk: Користувач

source: Start Date
uk: Дата початку

source: End Date
uk: Дата закінчення

source: Service Package
uk: Пакет послуг

source: Total Price
uk: Загальна ціна

source: Monthly Payment
uk: Щомісячний платіж

source: Status
uk: Статус

source: Leasing Contract
uk: Лізинговий контракт

source: Leasing Contracts
uk: Лізингові контракти

source: Price Calculation
uk: Розрахунок ціни

source: Package Price
uk: Ціна пакета

source: Price for 1 year leasing
uk: Ціна за 1 рік лізингу

source: Monthly Payment per year
uk: Щомісячний платіж на рік

source: Selected Package
uk: Обраний пакет

source: Services Included
uk: Включені послуги

source: No package selected
uk: Пакет не обрано

source: Submit
uk: Відправити

source: Selected Car
uk: Обраний автомобіль

source: THE CAR IN PRIVATE LEASING IS YOUR NEW LEVEL
uk: АВТОМОБІЛЬ У ПРИВАТНОМУ ЛІЗИНГУ - ВАШ НОВИЙ РІВЕНЬ

source: BOICHUKAUTO - PRIVATE CAR LEASING
uk: BOICHUKAUTO - ПРИВАТНИЙ ЛІЗИНГ АВТОМОБІЛІВ

source: Dreams should come true to the MAXIMUM! Live now, invest in yourself, take a car on private lease! This is the message of BoichukAuto, which started to provide cars for operational leasing to private individuals. For 25 years in Ukraine, BoichukAuto specialists have been leasing fleets of hundreds of cars with full service for large companies. Now it's time to provide access to this service for you!
uk: Мрії повинні здійснюватися на МАКСИМУМ! Живіть зараз, інвестуйте в себе, візьміть автомобіль у приватний лізинг! Це послання BoichukAuto, яке почало надавати автомобілі в оперативний лізинг приватним особам. Протягом 25 років в Україні фахівці BoichukAuto орендували парки сотень автомобілів із повним обслуговуванням для великих компаній. Тепер настав час надати доступ до цієї послуги вам!

source: How does BoichukAuto private leasing work?
uk: Як працює приватний лізинг BoichukAuto?

source: You invest in yourself, your family, or your business, and we buy you a new car and take care of it. You use it for a monthly fee, which includes a full service package.
uk: Ви інвестуєте в себе, свою родину або свій бізнес, а ми купуємо для вас новий автомобіль і дбаємо про нього. Ви користуєтесь ним за місячну плату, яка включає повний пакет послуг.

source: What is included in the service package?
uk: Що входить до пакету послуг?

source: We select a new car for you that best suits your needs and buy it for you
uk: Ми обираємо для вас новий автомобіль, який найкраще відповідає вашим потребам, і купуємо його для вас.

source: We pay the pension fund tax, luxury tax, register the car, insure the car and hand it over to you
uk: Ми сплачуємо податок до пенсійного фонду, податок на розкіш, реєструємо автомобіль, страхуємо автомобіль і передаємо його вам.

source: We organize car maintenance only at official service stations, our drivers take care to deliver it to the service and return it to you
uk: Ми організуємо обслуговування автомобіля тільки на офіційних сервісних станціях, наші водії доставляють його на сервіс і повертають вам.

source: Twice a year we organize tire replacement and storage of seasonal tires, deliver your car to the tire service and return it to you
uk: Двічі на рік ми організовуємо заміну шин і зберігання сезонних шин, доставляємо ваш автомобіль на шиномонтаж і повертаємо вам.

source: Provide a replacement car if yours is being repaired for more than a day
uk: Надаємо підмінний автомобіль, якщо ваш ремонтується більше одного дня.

source: Prepare documents for driving a car abroad
uk: Готуємо документи для виїзду за кордон на автомобілі.

source: How is the payment formed?
uk: Як формується оплата?

source: When you sign a contract, you pay for 4 months of car use at once. For the first month and the final three (as a guarantee payment). Then you pay monthly in equal installments. The amount of the monthly fee for using the car is fixed for the entire term of the agreement. For a monthly fee, you get a new car with a full all-inclusive service package.
uk: Під час підписання контракту ви оплачуєте 4 місяці користування автомобілем одразу. За перший місяць і останні три (як гарантійний платіж). Потім ви платите щомісяця рівними частинами. Сума щомісячної плати за користування автомобілем фіксується на весь термін угоди. За місячну плату ви отримуєте новий автомобіль із повним пакетом послуг all-inclusive.

source: How to choose the car of your dreams?
uk: Як обрати автомобіль своєї мрії?

source: Choose your dream car of any brand in your favorite configuration, and we will order it for you from an authorized dealer. If you have already chosen a car in the showroom, we can buy it for you in official dealer networks throughout Ukraine and deliver it to you.
uk: Виберіть автомобіль своєї мрії будь-якої марки в улюбленій комплектації, і ми замовимо його для вас у офіційного дилера. Якщо ви вже вибрали автомобіль у салоні, ми можемо купити його для вас у офіційних дилерських мережах по всій Україні та доставити вам.

source: How to get a car today?
uk: Як отримати автомобіль сьогодні?

source: Choose a new car from our warehouse and get it on the same day you sign the agreement. New cars are already in the fleet for private leasing: Skoda Fabia, Skoda Scala, Toyota Corolla, Toyota Camry, Renault Duster, Suzuki Vitara, Skoda Karoq, Skoda Kodiaq, Hyundai Tucson, Toyota RAV4, Toyota Highlander.
uk: Виберіть новий автомобіль зі складу та отримайте його в той же день, коли підпишете угоду. Нові автомобілі вже є в парку для приватного лізингу: Skoda Fabia, Skoda Scala, Toyota Corolla, Toyota Camry, Renault Duster, Suzuki Vitara, Skoda Karoq, Skoda Kodiaq, Hyundai Tucson, Toyota RAV4, Toyota Highlander.

source: How to get a car on private lease?
uk: Як отримати автомобіль у приватний лізинг?

source: Choose a car
uk: Виберіть автомобіль

source: Contact us at +38 067 462 05 20
uk: Зв'яжіться з нами за номером +38 067 462 05 20

source: Send us the documents
uk: Надішліть нам документи

source: Sign the agreement
uk: Підпишіть угоду

source: Get a car
uk: Отримайте автомобіль

source: What documents are needed?
uk: Які документи потрібні?

source: Passport
uk: Паспорт

source: Driver's license
uk: Водійське посвідчення

source: Identification code
uk: Ідентифікаційний код

source: Bank statement
uk: Виписка з банку

source: What are your benefits?
uk: Які ваші переваги?

source: You get the car you dreamed of, and no less
uk: Ви отримуєте автомобіль своєї мрії, і нічого менше

source: Save your savings for important things
uk: Збережіть свої заощадження для важливих справ

source: Save time for global affairs
uk: Зекономте час для глобальних справ

source: Keep calm, because you are always by car under any circumstances
uk: Залишайтеся спокійними, тому що ви завжди на автомобілі за будь-яких обставин

source: Live now - drive a car today
uk: Живіть зараз - керуйте автомобілем сьогодні

source: Why choose BoichukAuto if you lease a car?
uk: Чому обрати BoichukAuto для лізингу автомобіля?

source: BoichukAuto is a local division of the international mobility services provider Avis, which has been leasing large fleets to large companies and providing turnkey services for 25 years in Ukraine, and now provides cars for lease and rental to individuals.
uk: BoichukAuto - це місцевий підрозділ міжнародного постачальника мобільних послуг Avis, який протягом 25 років в Україні займається лізингом великих автопарків для великих компаній та надає послуги під ключ, а тепер надає автомобілі в лізинг і оренду для приватних осіб.

source: 77 years of the BoichukAuto brand in the world
uk: 77 років бренду BoichukAuto у світі

source: 25 years of BoichukAuto operation in Ukraine
uk: 25 років роботи BoichukAuto в Україні

source: 3,500 cars in the BoichukAuto leasing fleet
uk: 3 500 автомобілів у лізинговому флоті BoichukAuto

source: 500 cars in the BoichukAuto rental fleet
uk: 500 автомобілів в орендному флоті BoichukAuto

source: 450 service partners service the cars in the BoichukAuto fleet
uk: 450 сервісних партнерів обслуговують автомобілі у флоті BoichukAuto

source: What are our contacts?
uk: Які наші контакти?

source: Maksym Boichuk, Private Leasing Manager: +38 067 000 00 00
uk: Максим Бойчук, менеджер з приватного лізингу: +38 067 000 00 00

source: BoichukAuto, a car leasing service provider: 0 800 000 000 - free of charge from mobile numbers in Ukraine, +38 044 000 00 00 - for calls from abroad
uk: BoichukAuto, постачальник послуг лізингу автомобілів: 0 800 000 000 - безкоштовно з мобільних номерів в Україні, +38 044 000 00 00 - для дзвінків з-за кордону

source: Try it!
uk: Спробуйте!

source: Types of service packages
uk: Види пакетів послуг

source: Base services
uk: Базові послуги

source: Premium services
uk: Преміум послуги

source: Leasing for Legal Entities
uk: Лізинг для юридичних осіб

source: Information about leasing for legal entities and leasing rules.
uk: Інформація про лізинг для юридичних осіб та правила лізингу.

source: Detailed information about the leasing process, conditions, and benefits for legal entities.
uk: Детальна інформація про процес лізингу, умови та переваги для юридичних осіб.

source: Further details and rules about leasing for legal entities.
uk: Детальніші відомості та правила лізингу для юридичних осіб.

source: Go to Catalog
uk: Перейти до каталогу

source: Contract has been created!
uk: Контракт створено!

source: This car is already booked during the selected dates. Available after
uk: Цей автомобіль вже заброньовано на вибрані дати. Доступний після

source: HOME
uk: ГОЛОВНА

source: LEASING
uk: ЛІЗИНГ

source: For legal entities
uk: Для юридичних осіб

source: For individuals
uk: Для фізичних осіб

source: Types of services
uk: Види послуг

source: CAR CATALOG
uk: КАТАЛОГ АВТО

source: ABOUT US
uk: ПРО НАС

source: CABINET
uk: КАБІНЕТ

source: Admin Panel
uk: Адмін панель

source: Profile
uk: Профіль

source: Log out
uk: Вийти

source: Log in
uk: Увійти

source: Log up
uk: Зареєструватися

source: Search
uk: Пошук
