from django.shortcuts import render
from django.http import HttpResponse

def index(request):
    context = {
        'title': 'Home - Главная',
        'content': "Лізинг разом з BoichukAuto"
    }

    return render(request, 'main/index.html', context)


def about(request):
    context = {
        'title': 'Home - О нас',
        'content': "О нас",
        'text_on_page': "Цілі та області застосування веб-застосунку з надання послуг лізингу авто можуть включати:1. Забезпечення зручності для клієнтів: Розробка веб-застосунку дозволить клієнтам легко знаходити і оформляти угоди на лізинг автомобілів, зменшуючи час і зусилля, необхідні для цього.2. Покращення доступності: Веб-застосунок може бути доступним для клієнтів з будь-якого пристрою з Інтернет-підключенням, що робить послугу лізингу авто більш доступною та зручною.3. Автоматизація процесів: Застосування веб-технологій дозволяє автоматизувати багато аспектів управління лізинговими угодами, включаючи розрахунок вартості, підписання документів та стеження за термінами дії угод.4. Підвищення ефективності: Веб-застосунок може забезпечити ефективне керування процесами лізингу, спрощуючи адміністративні завдання та зменшуючи кількість помилок." }

    return render(request, 'main/about.html', context)